Core/src/src/InformationRegisters/AzRyНапоминанияПользователя/AzRyНапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AzRyНапоминанияПользователя</name>
  <resources>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиВремениНапоминания</name>
    <type>
      <types>EnumRef.СпособыУстановкиВремениНапоминания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРеквизитаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВерсияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеИсточника</name>
    <comment>Представление источника</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатусНапоминания</name>
    <type>
      <types>EnumRef.AzRyСтатусНапоминания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Documents/ОприходованиеЗапасов/ОприходованиеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеЗапасов</name>
  <basedOn>Document.ИнвентаризацияЗапасов</basedOn>
  <basedOn>Document.ПриходныйОрдер</basedOn>
  <basedOn>Document.ПриемИПередачаВРемонт</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыВРазрезеГТД</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыКПоступлениюНаСклады</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыВВалюте</registerRecords>
  <registerRecords>AccumulationRegister.СерийныеНомера</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.КонтрольСроковГодностиТовара</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.ИнвентаризацияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщика</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/AzRyНапоминанияПользователя/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("Получатель") Тогда
		Запись.СтатусНапоминания = Параметры.СтатусНапоминания;
		Запись.Получатель = Параметры.Получатель;
		Запись.Отправитель = Параметры.Отправитель;
		Запись.Источник = Параметры.Источник;
		Возврат;
	КонецЕсли;	       
	
	Если Запись.СтатусНапоминания = Перечисления.AzRyСтатусНапоминания.Finnished Тогда
		ЭтаФорма.КоманднаяПанель.Доступность = РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.AzRyОтветственныйЗаСкладСтатусДокумента.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Получатель.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Отправитель.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Источник.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		Элементы.Комментарий.ТолькоПросмотр = Не РольДоступна("AzRyНапоминанияПользователяАдминистратор");
	Иначе
		ПравоНаРедактирование = Запись.Получатель = Пользователи.ТекущийПользователь() Или РольДоступна("AzRyНапоминанияПользователяАдминистратор");
		ЭтаФорма.КоманднаяПанель.Доступность = ПравоНаРедактирование;
		Элементы.AzRyОтветственныйЗаСкладСтатусДокумента.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Получатель.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Отправитель.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Источник.ТолькоПросмотр = Не ПравоНаРедактирование;
		Элементы.Комментарий.ТолькоПросмотр = Не ПравоНаРедактирование;		
	КонецЕсли;
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДанныеТаблицыЗначенийВТабличныйДокумент(ДанныеВТабличныйДокумент)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеВТабличныйДокумент);       
	Построитель.Вывести(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;

КонецФункции

&НаКлиенте
Процедура AzRyОтветственныйЗаСкладСтатусДокументаПриИзменении(Элемент)
	
	AzRyОтветственныйЗаСкладСтатусДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура AzRyОтветственныйЗаСкладСтатусДокументаПриИзмененииНаСервере()
	
	Если Запись.СтатусНапоминания = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено Или Запись.СтатусНапоминания = Перечисления.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено Тогда
		
		Запись.Получатель = Параметры.Ключ.Отправитель;
		Запись.Отправитель   = Параметры.Ключ.Получатель;		
		
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура AzRyОтветственныйЗаСкладСтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПустаяСсылка") Тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));
		
	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения") И ЗначениеЗаполнено(Параметры.Ключ) = Ложь Тогда // ახალის შემთხვევაში
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));                                                                         

	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения") И ЗначениеЗаполнено(Параметры.Ключ) = Истина Тогда // არსებულის შემთხვევაში
		ДанныеВыбора = Новый СписокЗначений;
		//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено"));		
		
	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено") Тогда
		ДанныеВыбора = Новый СписокЗначений;
		//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено"));
		//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.Finnished"));
		
	ИначеЕсли Запись.СтатусНапоминания = ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено") Тогда
		ДанныеВыбора = Новый СписокЗначений;                                                                          
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ОжидаетПодтверждения"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеОдобрено"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено"));
		
	КонецЕсли; 	
	
	Если РольДоступнаНаСервере("AzRyНапоминанияПользователяАдминистратор") Тогда
		СтандартнаяОбработка = Истина;		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция РольДоступнаНаСервере(Роль)

	Возврат РольДоступна(Роль);

КонецФункции
 
&НаКлиенте
Процедура КомандаТоварыВДокументе(Команда)
	
	ТабДок = КомандаТоварыВДокументеНаСервере();
	ТабДок.Показать("დოკუმენტის ნომენკლატურის სია");
	
КонецПроцедуры

&НаСервере
Функция КомандаТоварыВДокументеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;  
	Запрос.Текст = ТекстЗапросаТоварыВДокументе(Запись.Источник);
	Запрос.УстановитьПараметр("Ссылка", Запись.Источник);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Кеш = Новый Соответствие;
	Кеш.Вставить(1, "კოდი");
	Кеш.Вставить(2, "ნომენკლატურა");
	Кеш.Вставить(3, "ზომის ერთეული");
	Кеш.Вставить(4, "მახასიათებელი");
	Кеш.Вставить(5, "რაოდენობა");
	
	ТабДок = Новый ТабличныйДокумент;
	Сч = 1;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		ТабДок.Область(1, Сч).Текст = Кеш.Получить(Сч);
		Сч = Сч + 1
	КонецЦикла;
	
	КоличествоКолонок = ТЗ.Колонки.Количество();
	
	ТекущаяСтрока = 2;
	Для Каждого Стр Из ТЗ Цикл
		Для Сч = 1 По КоличествоКолонок Цикл
			ТабДок.Область(ТекущаяСтрока, Сч).Текст = Стр[Сч - 1];			
		КонецЦикла;
		ТекущаяСтрока = ТекущаяСтрока + 1;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабДок
	
КонецФункции

&НаСервере
Функция ТекстЗапросаТоварыВДокументе(СсылкаДокумента)

	ТексЗапроса = "";
	
	Если Тип("ДокументСсылка.ПриходнаяНакладная") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПриходнаяНакладнаяЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		              |	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		              |	ПриходнаяНакладнаяЗапасы.Количество КАК Количество
		              |ИЗ
		              |	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		              |ГДЕ
		              |	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	ПриходнаяНакладнаяРасходы.Номенклатура.Код,
		              |	ПриходнаяНакладнаяРасходы.Номенклатура,
		              |	ПриходнаяНакладнаяРасходы.ЕдиницаИзмерения,
		              |	NULL,
		              |	ПриходнаяНакладнаяРасходы.Количество
		              |ИЗ
		              |	Документ.ПриходнаяНакладная.Расходы КАК ПриходнаяНакладнаяРасходы
		              |ГДЕ
		              |	ПриходнаяНакладнаяРасходы.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.АвансовыйОтчет") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	АвансовыйОтчетЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
		              |	АвансовыйОтчетЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	АвансовыйОтчетЗапасы.Характеристика КАК Характеристика,
		              |	АвансовыйОтчетЗапасы.Количество КАК Количество
		              |ИЗ
		              |	Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
		              |ГДЕ
		              |	АвансовыйОтчетЗапасы.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	АвансовыйОтчетРасходы.Номенклатура.Код,
		              |	АвансовыйОтчетРасходы.Номенклатура,
		              |	АвансовыйОтчетРасходы.ЕдиницаИзмерения,
		              |	NULL,
		              |	АвансовыйОтчетРасходы.Количество
		              |ИЗ
		              |	Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
		              |ГДЕ
		              |	АвансовыйОтчетРасходы.Ссылка = &Ссылка";		
		
	ИначеЕсли Тип("ДокументСсылка.ЗаказПокупателя") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ЗаказПокупателяЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		              |	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		              |	ЗаказПокупателяЗапасы.Количество КАК Количество
		              |ИЗ
		              |	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		              |ГДЕ
		              |	ЗаказПокупателяЗапасы.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ОприходованиеЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ОприходованиеЗапасовЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ОприходованиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		              |	ОприходованиеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ОприходованиеЗапасовЗапасы.Характеристика КАК Характеристика,
		              |	ОприходованиеЗапасовЗапасы.Количество КАК Количество
		              |ИЗ
		              |	Документ.ОприходованиеЗапасов.Запасы КАК ОприходованиеЗапасовЗапасы
		              |ГДЕ
		              |	ОприходованиеЗапасовЗапасы.Ссылка = &Ссылка";

	ИначеЕсли Тип("ДокументСсылка.ОтчетОРозничныхПродажах") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ОтчетОРозничныхПродажах.Номенклатура.Код КАК НоменклатураКод,
		              |	ОтчетОРозничныхПродажах.Номенклатура КАК Номенклатура,
		              |	ОтчетОРозничныхПродажах.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ОтчетОРозничныхПродажах.Характеристика КАК Характеристика,
		              |	ОтчетОРозничныхПродажах.Количество КАК Количество
		              |ИЗ
		              |	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажах
		              |ГДЕ
		              |	ОтчетОРозничныхПродажах.Ссылка = &Ссылка";

	ИначеЕсли Тип("ДокументСсылка.ПеремещениеЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПеремещениеЗапасов.Номенклатура.Код КАК НоменклатураКод,
		              |	ПеремещениеЗапасов.Номенклатура КАК Номенклатура,
		              |	ПеремещениеЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПеремещениеЗапасов.Характеристика КАК Характеристика,
		              |	ПеремещениеЗапасов.Количество КАК Количество
		              |ИЗ
		              |	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
		              |ГДЕ
		              |	ПеремещениеЗапасов.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ПеремещениеПоЯчейкам") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПеремещениеПоЯчейкам.Номенклатура.Код КАК НоменклатураКод,
		              |	ПеремещениеПоЯчейкам.Номенклатура КАК Номенклатура,
		              |	ПеремещениеПоЯчейкам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПеремещениеПоЯчейкам.Характеристика КАК Характеристика,
		              |	ПеремещениеПоЯчейкам.Количество КАК Количество
		              |ИЗ
		              |	Документ.ПеремещениеПоЯчейкам.Запасы КАК ПеремещениеПоЯчейкам
		              |ГДЕ
		              |	ПеремещениеПоЯчейкам.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.РасходнаяНакладная") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	РасходнаяНакладная.Номенклатура.Код КАК НоменклатураКод,
		              |	РасходнаяНакладная.Номенклатура КАК Номенклатура,
		              |	РасходнаяНакладная.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	РасходнаяНакладная.Характеристика КАК Характеристика,
		              |	РасходнаяНакладная.Количество КАК Количество
		              |ИЗ
		              |	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладная
		              |ГДЕ
		              |	РасходнаяНакладная.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ПриходныйОрдер") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПриходныйОрдер.Номенклатура.Код КАК НоменклатураКод,
		              |	ПриходныйОрдер.Номенклатура КАК Номенклатура,
		              |	ПриходныйОрдер.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПриходныйОрдер.Характеристика КАК Характеристика,
		              |	ПриходныйОрдер.Количество КАК Количество
		              |ИЗ
		              |	Документ.ПриходныйОрдер.Запасы КАК ПриходныйОрдер
		              |ГДЕ
		              |	ПриходныйОрдер.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ПриходныйОрдер") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ПриходныйОрдер.Номенклатура.Код КАК НоменклатураКод,
		              |	ПриходныйОрдер.Номенклатура КАК Номенклатура,
		              |	ПриходныйОрдер.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ПриходныйОрдер.Характеристика КАК Характеристика,
		              |	ПриходныйОрдер.Количество КАК Количество
		              |ИЗ
		              |	Документ.ПриходныйОрдер.Запасы КАК ПриходныйОрдер
		              |ГДЕ
		              |	ПриходныйОрдер.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.СборкаЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	СборкаЗапасов.Номенклатура.Код КАК НоменклатураКод,
		              |	СборкаЗапасов.Номенклатура КАК Номенклатура,
		              |	СборкаЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	СборкаЗапасов.Характеристика КАК Характеристика,
		              |	СборкаЗапасов.Количество КАК Количество
		              |ИЗ
		              |	Документ.СборкаЗапасов.Продукция КАК СборкаЗапасов
		              |ГДЕ
		              |	СборкаЗапасов.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	СборкаЗапасов.Номенклатура.Код,
		              |	СборкаЗапасов.Номенклатура,
		              |	СборкаЗапасов.ЕдиницаИзмерения,
		              |	NULL,
		              |	СборкаЗапасов.Количество
		              |ИЗ
		              |	Документ.СборкаЗапасов.Запасы КАК СборкаЗапасов
		              |ГДЕ
		              |	СборкаЗапасов.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.СборкаЗапасов") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ЧекККМЗапасы.Номенклатура.Код КАК НоменклатураКод,
		              |	ЧекККМЗапасы.Номенклатура КАК Номенклатура,
		              |	ЧекККМЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЧекККМЗапасы.Характеристика КАК Характеристика,
		              |	ЧекККМЗапасы.Количество КАК Количество
		              |ИЗ
		              |	Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
		              |ГДЕ
		              |	ЧекККМЗапасы.Ссылка = &Ссылка";
		
	ИначеЕсли Тип("ДокументСсылка.ЧекККМВозврат") = ТипЗнч(СсылкаДокумента) Тогда
		
		ТексЗапроса = "ВЫБРАТЬ
		              |	ЧекККМВозврат.Номенклатура.Код КАК НоменклатураКод,
		              |	ЧекККМВозврат.Номенклатура КАК Номенклатура,
		              |	ЧекККМВозврат.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		              |	ЧекККМВозврат.Характеристика КАК Характеристика,
		              |	ЧекККМВозврат.Количество КАК Количество
		              |ИЗ
		              |	Документ.ЧекККМВозврат.Запасы КАК ЧекККМВозврат
		              |ГДЕ
		              |	ЧекККМВозврат.Ссылка = &Ссылка";		
			
	КонецЕсли; 
	
	Возврат ТексЗапроса;

КонецФункции
